// Задание 4.1. Вывод карточек товаров



function parseProducts(json) 
  let data = JSON.parse(json)
    let products = JSON.parse(json)
    return(products)
        
    
    // Аргументом функции является JSON, JSON - это тип функции
    // Преобразуйте строку json, переданную как аргумент функции,
    // в объект с помощью функции JSON.parse(JSON.parsejson)
    // и запишите в переменную data
    // Верните как результат функции свойство products объекта data


// Напишите функцию renderProductsCards(json)
// Аргументом функции является JSON
// Выполните функцию clearProducts - она уже написана в коде, просто вызовите ее, аргументы не требуются
// Выполните функцию parseProducts, передав в неё json - аргумент функции и запишите результат в переменную products
// Запишите в переменную length значение свойства products.length
// Напишите цикл, в котором перебираете все products от 0 до (length - 1)
// и выполняете addProduct с каждым элементом массива products (передавая элемент массива как аргумент)
